app/controllers/api/v1/users_controller.rb

      def index
        users = User.order(:name)
        render json: users.map { |u| UserSerializer.new(u).as_json }
---
SELECT "users".* FROM "users"